{
    "users": [
        {
            "id": "1",
            "username": "dan",
            "password": "12345"
        },
        {
            "id": "2",
            "username": "mika",
            "password": "mika123"
        },
        {
            "id": "3",
            "username": "pera",
            "password": "pera123"
        }
    ],
    "subscriptions": [
        {
            "user_id": "1",
            "news_tag": "sports"
        },
        {
            "user_id": "1",
            "news_tag": "politics"
        },
        {
            "user_id": "2",
            "news_tag": "sports"
        },
        {
            "user_id": "3",
            "news_tag": "crime"
        }
    ],
    "news": [
        {
            "id": "1",
            "date": "2/04/2019",
            "tag": "sports",
            "img": "../resource/img1.jpg",
            "headline": "Mercedes looking to rebound at Chinese GP",
            "new": "true",
            "content": "After a jubilant Sebastian Vettel emerged as the surprise winner for Ferrari at the Malaysian Grand Prix two weeks ago, a season once expected to be dominated by the silver cars of Mercedes could be shaping up to be far more competitive.Mercedes came into the 2015 season as the team to beat following a dominant campaign last year that saw Lewis Hamilton and Nico Rosberg sweep to victory in 16 of 19 races. The only suspense was generated by the fight between the Mercedes teammates for the drivers' championship, which Hamilton eventually captured.But Vettel showed in Malaysia that the rest of the field wasn't prepared to move aside.The four-time world champion, in just his second race for Ferrari after leaving Red Bull, benefited from a blisteringly hot track that caused Mercedes' tires to degrade quickly, but Vettel's Ferrari car also showed improved pace over last year.Mercedes team principal Toto Wolff said after the race it was the wake-up call that we needed.Malaysia was a tough weekend, Hamilton said ahead of Sunday's Chinese GP. I think ultimately we made the best choices we could, but there is always room for improvement and we've been working hard to analyze everything for the next race.Hamilton, who captured the season-opening race in Australia and was second in Malaysia, will be hoping for a boost on a track where he's enjoyed considerable success. He's won the Chinese Grand Prix three times — more than any other driver — and finished on the podium six times overall.Shanghai is one of my favorite locations, Hamilton said. The circuit itself is a different challenge to Albert Park (in Australia) and Sepang (Malaysia), but it's one I really enjoy and it suits my driving style quite well.Mercedes technical chief Paddy Lowe said the team has spent the past two weeks trying to make improvements to the car, citing its most significant weakness as tire management during long runs. He said the team also addressed the car's aerodynamics.It is now clearer than ever that there is serious competition for this world championship, so we will continue to work flat out for performance gains, Lowe said.The conditions in Shanghai should cause less tire degradation compared to Malaysia, with temperatures only expected to reach about 21 degrees Celsius (70 Fahrenheit) for the race on Sunday.The other top teams will be looking to play catch-up after difficult starts to the year.McLaren has struggled with a host of issues with its Honda engines and managed just one finish in the first two F1 races — Jenson Button's 11th place result in Melbourne. The team has acknowledged that the long straights in Shanghai will also make it tough to close the gap.Still, new McLaren driver Fernando Alonso sounded upbeat about the car's progress since the start of the season.The steps we took between Australia and Malaysia were extremely impressive — it was a great feeling to be able to mix it with other cars and drivers, and I hope we can do more of the same in China, he said.Red Bull has faced even more questions as French automaker Renault, which supplies engines to the team, has threatened to pull out of the sport if it doesn't see improvements on the track.In an interview with Formula1.com on Monday, Helmut Marko, Red Bull's senior advisor, called the start of the season a catastrophe. The team's best finish has been Daniel Ricciardo's sixth place in Melbourne.We are significantly behind Mercedes. They clearly dominate, Marko said.As for whether Renault could pull out, Marko said the carmaker is spending a lot of money on this power unit — not as much as Mercedes but a significant amount — and (is) confronted with the same issues that we have: their F1 involvement has to pay off.Red Bull won the drivers' and teams' championships from 2010-13 with Renault before the sport switched to V6 hybrid engines last year."
        },
        {
            "id": "2",
            "date": "1/04/2019",
            "tag": "travel",
            "img": "../resource/img2.jpg",
            "headline": "Florida travel calendar for August",
            "new": "true",
            "content": "Check out festivals and events in August across the state. View events this coming weekend, or view the whole month's offerings by region below.This list is organized by region.Central Florida: (Including Orlando, Kissimmee, Daytona Beach, Sanford, the Space Coast, Lakeland/Polk and Lake County).Through Sept. 1: SeaWorld's Electric Ocean, Orlando. As the sun goes down, the park comes alive with the glow of Electric Ocean at SeaWorld, returning next year for another summer of fun. With exciting nighttime shows and electrifying music, guests are immersed in a sea of wonder that ends in Ignite, a spectacular finale with fireworks, lasers and fountains. Select nights with the price of admission. Through Sept. 27: Bandshell Concert Series, Daytona Beach. The Bandshell Concert Series, in its 11th year, runs every Friday night. Concerts begin at 7 p.m. Tickets free for general admission; $10 for VIP (includes a chair) plus applicable fees, but children under 10 are free. At the amphitheater located in Oceanfront Park on the North end of the Boardwalk amusement area at 250 N. Atlantic Avenue. 386-255-0415. www.daytonabandshell.comAug. 3: National Lighthouse Day, Ponce Inlet. See historical lighthouse exhibits, play games and make your own lighthouse pennant at the Ponce de Leon Inlet Lighthouse. Adults $6.95; children ages 2-11 $1.95. 4931 South Peninsula Drive. 386-761-1821.Aug. 9-11: Anime Festival, Orlando: This annual festival celebrates the finest in Anime and Japanese Culture entertainment with costume contests, gaming, karaoke, art show, dance party, game shows and merchandise. Featured guests include Mary Elizabeth McGlynn, Steve Blum and others.  Single day passes start at $35, with a standard 4-day pass starting at $45. At the Wyndham Orlando Resort. www.animefestivalorlando.comAug. 15: Climb to the Moon, Ponce Inlet. Climb to the Moon at Ponce Inlet Lighthouse offers views of the sunset and moonrise from atop Florida's tallest lighthouse on a select day each month. The lighthouse keeper relates the story of this National Historic Landmark, and visitors can enjoy beverages and hors d'oeuvres. Participation is limited to 25 people and tickets must be purchased in advance by calling 386-761-1821 ext. 10. 4931. 7:15 to 8:45 p.m. 4931 S. Peninsula Drive. www.ponceinlet.orgAug. 16-Nov. 1: (select dates): Mickey's Not-So-Scary Halloween Party, Walt Disney World. The special event at Magic Kingdom will be held on select dates on 32 nights through October 31. The event again will include the Happy HalloWishes fireworks display, Mickey's Boo-to-You Halloween Parade and the Hocus Pocus Villain Spelltacular stage show in front of Cinderella Castle. Check website for dates. Prices range from $74 to $115 ($69 to $110 for ages 3-9) with earlier nights being the least expensive. 407-824-4321. disneyworld.com/halloween. Aug. 17-18: 25th Annual Harvest Grape Stomp, Clermont. Join grape stomping competitions during this now three-day event at the Lakeridge Winery. Local musicians entertain and there are free winery tours and tastings. Friday and Saturday; 10 a.m. to 5 p.m. Sunday;11 a.m. to 5 p.m. Sunday. Adults $10. 12 and under are free. 19239 U.S. Highway 27. 800-768-WINE. www.lakeridgewinery.com. Aug. 17-18: 4 Wheel Parts Orlando Truck & Jeep Fest, Orlando. Off-road enthusiasts can enjoy the largest off-road touring show. The event features custom trucks and jeeps, product demonstrations and hourly giveaways. Saturday 10 a.m. to 4 p.m., Sunday 11 a.m. to 4 p.m. Free. Gaylord Palms Resort and Convention Center, 6000 W. Osceola Parkway. 877-474-4821.www.4wheelparts.com. Aug. 23-25: Orlando Fall Home & Garden Show, Orlando. The 10th annual three-day event at the Orange County Convention Center will feature areas for home design, garden, new products, shopping and healthy living, kid's zone and live birds of prey and pet zone. Registation prices vary, On-site parking is $10. http://showtechnology.com/event/orlando-fall-home-garden-show/. Aug. 23-Sept. 30: Magical Dining Month, Orlando. Visit Orlando's Magical Dining Month named Best Foodie City in the Nation by Wallethub is in its 14th year. The promotion is offered at more than 100 area restaurants with $35 prixe-fixe three-course meals. One dollar from each meal served during Magical Dining is being donated to this year's charities, Freedom Ride and BASE Camp Children's Cancer Foundation. OrlandoMagicalDining.com"
        },
        {
            "id": "3",
            "date": "3/04/2017",
            "tag": "food",
            "img": "../resource/img3.jpg",
            "headline": "Thanksgiving recipes from our food writers' home kitchens",
            "new": "false",
            "content": "The airfares to Europe are really good this November. I thought I’d mention that because I’ve been spending a certain amount of time thinking about Thanksgiving week in Tuscany, where I could be drinking Brunello and eating wild boar chops instead of stuffing sage leaves under the puckery skin of a bird. In Pienza they’ve never heard of Thanksgiving, but they can point you to fresh pecorino showered with truffles. The sweet potato casserole with marshmallows can wait. 2017 has been a tough year for everyone in America. It is useless to deny it. But I won’t be going to Italy this week, and neither will you. We will bake our pumpkin pies and dry bread for our stuffing and wonder whether to go with something from Sonoma or an Alsatian Pinot Gris. We will resign ourselves to making half the Brussels sprouts vegan because that’s how some of the family rolls. We will put buttermilk in the mashed potatoes and caramelized onions in the green beans. We will contemplate making fresh Parker House rolls but probably end up glazing store-bought ones with extra butter instead. Because when you are the cook at Thanksgiving, no matter where your sentiments may lie, family and friends are drawn toward the center of your world, a calm, fragrant place where the wine is well-chilled, the Lions game is on in the den, and the mulling spices in the cranberries are the same from year to year to year. You will make turkey, whether Filipino-style adobo, Cuban-style with garlic and lemon, with tomato gravy and relajo the way Salvadoran friends usually do — or the way your grandmother learned to do it from her grandmother. You will let someone else fuss with the green salad, the flowers and the playlist. You will wish you had three ovens and 12 burners. You will somehow make do. Is there chaos in the kitchen? There’s always chaos in the kitchen! But it all gets resolved somehow, even the year when a 3-year-old cranks the oven temperature up to 550 and it is a full half hour before anybody notices. Does your first-grader think mushrooms are the most disgusting things in the world? Chop them a little and she won’t notice them in the stuffing. Do two guests snipe like Joan Crawford and Bette Davis when they both bring the same pie? Proclaim both of them delicious. If you’re lucky, it will all be forgotten by the second glass of Scotch."
        },
        {
            "id": "4",
            "date": "2/04/2019",
            "tag": "politics",
            "img": "../resource/img4.jpg",
            "headline": "Democrats go bold on economic plans, a deliberate contrast to 2016",
            "new": "false",
            "content": "Asked what her very first act as president would be, Sen. Kamala Harris had a quick answer at a recent televised town hall: Enact a tax cut that would boost incomes for working families by as much as $6,000 a year. Sen. Elizabeth Warren followed the launch of her campaign by unveiling a tax on the super-rich that backers say could raise as much as $275 billion a year. Sen. Cory Booker, who entered the race last week, touts his plan for government-paid trust funds for every American baby, which supporters say could dramatically shrink the racial wealth gap. Candidates in primaries battle with their personalities and life stories. Campaigns, however, also serve as contests of ideas, especially for a party trying to redefine itself after a traumatic defeat. As the Democratic field takes shape this winter, the ideas primary is well underway. Plans for expanded healthcare coverage, efforts to combat global warming and reform of the political system all compete for attention. But many of the ideas gaining the most traction share a common theme: How can the U.S. combat growing inequality of wealth and stagnation of wages for low- and middle-income workers, problems that have dominated the economic landscape for much of the last two decades? The drive to come up with boldly stated economic policies reflects a lurch of the Democratic Party to the left since President Trump’s election. The shift involves political risk, potentially reviving a debate over “big government” that Democrats backed away from a generation ago. Trump made clear in his State of the Union speech on Tuesday the line of attack he hopes to use against whichever Democratic nominee emerges: “We are born free, and we will stay free,” he declared. “America will never be a socialist country.” But the new crop of Democratic candidates clearly believes the country’s mood has shifted, if not to socialism, then at least a few steps toward a more Western European social democracy. Even in the midst of low unemployment, voters’ economic insecurity and fear that opportunities are disappearing for their children shape their views, said Lanae Erickson, senior vice president for policy at Third Way, a centrist Democratic group based in Washington. Across the party’s ideological spectrum, Democratic activists believe that Hillary Clinton failed in 2016 to connect with that concern. This time around, Erickson said, “everyone knows they’ll need some big ideas.” Taken together, those ideas say a lot about the state of the economic debate among Democrats. “I worked for the Obama administration, and I’m proud of what we did,” said Jared Bernstein, who was Vice President Joe Biden’s economic advisor. But among Democratic activists, whether fairly or not, “there’s a sense that our solutions were constrained.” Some of the drive to think big represents a reaction against “the boldness and baldness of the right-wing agenda,” including the 2017 tax cut, which gave the lion’s share of its benefits to the already well-off, said Connie Razza, vice president of policy at Demos, an advocacy group on the Democratic left. “Continuing to put forward things that are incremental is not enough,” she said. “We need policies that match the aspirations of the country.”  While the main Democratic hopefuls share many ideas, their signature proposals highlight differences among them, both in what they choose to emphasize and in their approaches to policy making. "
        },
        {
            "id": "5",
            "date": "1/04/2018",
            "tag": "local-news",
            "img": "../resource/img5.png",
            "headline": "Killing off rent-stabilized apartments to make way for tourist hotels? The struggle for the soul of Venice Beach rages on",
            "new": "false",
            "content": "On Monday morning, I walked from my house near the Venice Pier north along Ocean Front Walk. I wanted to check on something I heard last week at a West Los Angeles Area Planning Commission meeting that made me question my sense of reality. At the meeting, I heard folks who own stores along Ocean Front Walk tell planners that the Venice boardwalk is a commercial space, hardly residential at all, and that Venice has a severe hotel shortage. Therefore, argued the entrepreneurs, a landlord who converted a 32-unit rent-stabilized apartment building to a hotel without proper permits and in apparent violation of zoning laws should be allowed to keep operating his business. Despite the city’s insane housing shortage, they said, he should not be forced to restore the rent-stabilized units. Nobody lives on the boardwalk, see. It’s tourist central. “I’ve lived on the boardwalk for 50 years,” said Jordan Monkarsh, owner of Jody Maroni’s sausage stand, a Venice boardwalk fixture. “To say that my area is residential is silly.” Which is how I found myself standing in front of Monkarsh’s famous sausage shack on Monday, trying to validate my own belief that the boardwalk is every bit as much a residential neighborhood as a commercial one. Sure enough, Jody Maroni’s is dwarfed by the five-story apartment building next door. I guess it is possible to be so distracted by the T-shirt shops, restaurants and sidewalk vendors that you can miss the fact that the boardwalk is full of residences, too. True, the homes are not your typical suburban affair. They befit the urban beach environment; there are new multimillion-dollar houses jammed up against funky apartment buildings and run-down shacks. Much of the recent debate over the future of Venice Beach has focused on the incursion of tech companies such as Snapchat and Google, which have displaced many small businesses and turned once-thriving blocks into locked-up, blank storefronts.  But the housing market is really at the heart of the enduring struggle for the soul of Venice Beach. Will it be able to remain one of the only demographically mixed beach enclaves in the state, or become a more colorful version of Santa Monica’s hyperconsumerist Third Street Promenade, with a few strategically placed sidewalk performers, graffiti walls and skateboard pits to remind us of what Venice used to be? "
        },
        {
            "id": "6",
            "date": "1/04/2019",
            "tag": "sports",
            "img": "../resource/img6.jpg",
            "headline": "Magnussen and Kvyat join the F1 fast track",
            "new": "false",
            "content": "LONDON (Reuters) - Formula One fans may look back on 2014 as a special year not only for the biggest technical shakeup in decades but also for the debuts of two young drivers following in the footsteps of champions. Danish hotshot Kevin Magnussen and Russian teenager Daniil Kvyat will be starting out on what could be a road to glory when they line up for the first time on the grand prix grid in Melbourne on March 16. Magnussen, 21, is McLaren's first rookie since Lewis Hamilton made his debut in 2007 and comparisons have already been made between the two with the team describing him as pretty special and lightning quick. Kvyat, still only 19, joins Toro Rosso as the latest on a Red Bull production line that has produced four-times champion Sebastian Vettel and the German's new Australian team mate Daniel Ricciardo. In a sport where money talks, and buys race seats, both newcomers stand out because they have been fast-tracked on the basis of performance and potential rather than what they bring with them in the way of backing. The kid's very quick...very naturally talented, Red Bull principal Christian Horner said when Kvyat's appointment was announced. He's got a steep learning curve, but 100 percent he's there on talent. Both are the products of young driver programmes, carefully nurtured by top teams from an early age, and both won junior series titles last year - Magnussen in Formula Renault 3.5 and Kvyat in GP3. Along with 23-year-old Swede Marcus Ericsson, who is making his debut at lowly Caterham and has less to shout about after four unspectacular seasons in GP2, they form a trio of young guns graduating to the elite. NO GUARANTEES While Magnussen is the latest son of a racing father to enter Formula One, he is unusual in that he could achieve more on his debut than Jan managed in his entire F1 career. The older Dane, now a successful sportscar racer, also made his debut with McLaren in 1995 and was hailed by triple champion Jackie Stewart as the brightest prospect since Ayrton Senna when he joined the Scot's team in 1997. He had dominated the British F3 championship with more wins than triple champion Senna managed 11 years earlier and all looked good. But he had 12 retirements in 17 races that first year and in 1998, at the age of 25, was dropped. He had scored just one point from 25 grands prix. I wish I'd had another chance but Kevin is where he is today because of what happened to me. He can learn from my mistakes, Jan told the Guardian newspaper in January. He is much more mature than I was at 21. In fact there are no similarities...I was a smoker, I didn't train properly and was not at all organised. I was not ready for F1. Magnussen junior is every bit the modern professional and has shown how ready he is with session-topping times in testing, but race performances are what he will be judged on and he has been keeping his feet on the ground ahead of Melbourne. I'm a firm believer that there are no guarantees in this world, he told the formula1.com website last month. I know that all the work I did in the junior formulas was only enough to get me to the door of Formula One - and now I'm having to start all over again to prove that I deserve the opportunity to stay here. I'm determined to justify the faith that's been put in me. That faith is the main reason why Mexican Sergio Perez left the team after just one year, Magnussen considered a talent so promising that the former world champions could not afford to keep him waiting. Kvyat also muscled his way into contention late in the day at Toro Rosso when it looked like more experienced Portuguese Antonio Felix Da Costa had the seat sewn up. Some have suggested the opportunity has come too early in his career, citing the case of Spaniard Jaime Alguersuari who made his debut for Toro Rosso as a teenager and was then discarded, but the Russian is not short of confidence. Unlike Vitaly Petrov, Russia's first Formula One driver, Ufa-born Kvyat started karting as a nine-year-old and has come up through the ranks. Fluent in four languages, he moved to Italy when he was 12 and now lives in England. On his form so far, Formula One commentators may have more difficulties with the correct pronunciation of his name - he is happy with 'Danny' or 'DK' - than he has shown in adapting to the sport. I already had a go in free practice in Brazil and Austin (last season) and I found myself very well in the Formula One world. I didn't really have any big problems to adapt myself, he told Reuters earlier this year."
        },
        {
            "id": "7",
            "date": "1/04/2019",
            "tag": "science",
            "img": "../resource/img7.jpg",
            "headline": "Brains from slaughtered pigs are partly revived hours after death",
            "new": "false",
            "content": " Scientists restored some activity within the brains of pigs that had been slaughtered hours before, raising hopes for some medical advances and questions about the definition of death. The disembodied brains could not think or sense anything, researchers stressed. By medical standards “this is not a living brain,” said Dr. Nenad Sestan of the Yale School of Medicine, one of the researchers reporting the results Wednesday in the journal Nature. But the work revealed a surprising degree of resilience among cells within a brain that has lost its supply of blood and oxygen, he said. “Cell death in the brain occurs across a longer time window than we previously thought,” Sestan said. Such research might lead to new therapies for stroke and other conditions, as well as provide a new way to study the brain and how drugs work in it, researchers said. They said they had no current plans to try their technique on human brains. The 32 brains came from pigs killed for food at a local slaughterhouse. Scientists put the brains into an apparatus in their lab and began pumping a specially designed blood substitute through the organs four hours after the animals had died. The brains showed no large-scale electrical activity that would indicate awareness. Restoring consciousness was not a goal of the study, which was aimed instead at exploring whether particular functions might be restored long after death. After six hours of pumping, scientists found that individual brain cells in one area of the brain had maintained key features of their structure, while cells from untreated brains had severely degraded. "
        },
        {
            "id": "8",
            "date": "1/04/2019",
            "tag": "technology",
            "img": "../resource/img8.jpg",
            "headline": "Pinterest IPO: Shares soar in their stock-market debut",
            "new": "true",
            "content": "Pinterest Inc. stock soared in its trading debut after the company raised $1.4 billion in the second-biggest U.S. initial public offering of the year. Shares of the digital-scrapbooking company leaped to $24.40 on Thursday, up 28.4% from their IPO price of $19. The closing price gives Pinterest a market value of about $12.9 billion. The IPO was topped in the U.S. only by Lyft Inc.’s $2.34-billion offering in March. Uber Technologies Inc.’s will probably be even bigger. Ride-hailing’s global behemoth will seek to raise about $10 billion in May in an offering valuing it at about $100 billion, people familiar with its plans have said. Videoconferencing company Zoom Video Communications Inc. also began trading Thursday, and it impressed, vaulting more than 72%. Pinterest’s and Zoom’s strong showings signal that investors continue to thirst for new stocks as a surge of unicorns — start-ups valued at $1 billion or more — come to market. Other high-profile companies considering going public include messaging-platform maker Slack Technologies Inc., food-delivery app company Postmates Inc., data-mining contractor Palantir Technologies Inc. and short-term home-rental firm Airbnb Inc. “Today’s opening pop in the shares of Zoom and Pinterest suggests that investors are not looking at ‘risky’ unicorns as a group, but instead are valuing each company on their merits,” Alejandro Ortiz, principal analyst at SharesPost Inc., said in a emailed statement. Lyft’s stock has slid nearly 19% from its $72 IPO price, but fears that the decline would bode poorly for other unicorns appear to have been overblown, Ortiz said. Pinterest sold 75 million shares Wednesday for $19 each, after marketing them for $15 to $17. At the offer price, the IPO valued the San Francisco company at about $12.8 billion, including restricted stock and options, according to data compiled by Bloomberg. Pinterest’s last valuation, from a private funding round in 2017, was $12.3 billion. The offering was led by Goldman Sachs Group Inc., JPMorgan Chase & Co. and Allen & Co. Pinterest trades on the New York Stock Exchange under the symbol PINS. Pinterest operates in a crowded digital marketing space, in which Google and Facebook Inc. get the lion’s share of ad dollars. Pinterest has taken a slow and steady approach to growth and making money from the service, compared with the faster expansion rates of Facebook, Twitter Inc., and Snap Inc. when they went public. “We’re really proud of the progress we made over the last few years,” Chief Executive Ben Silbermann said in an interview. “We built out the business. We felt like we were at a point where the business had reached a level of predictability that it could be in the public markets.” Pinterest has a key advantage in competing for advertising dollars, Silbermann said: Unlike other sites, Pinterest users typically are looking to eventually buy what they are searching for, which lines up with what advertisers want. Pinterest said in its IPO filing that it reaches more than 250 million monthly active users. The company had about $756 million in revenue from online advertisements in 2018, a 60% growth rate that accelerated from the previous year. Its net loss shrank to $63 million in 2018 from $130 million in 2017. Most of its user growth is coming from international markets, where the average revenue per user is much lower than in the United States. In 2018, more than 80% of new users were outside the United States; however, they generated about 25 cents a person compared with $9.04 for those in the U.S. Silbermann said the company is in the “first chapter” of its international growth and now has sales teams in countries such as Canada, Germany and France. “We’re going to continue to invest for the long term,” he said. “We’ve shown really good margin improvement over the last few years. My eye is always on what’s going to make Pinterest great three years, five years, 10 years from now. That’s going to be how we continue to run the business.” Pinterest has done a great job of creating an ad business for the visual world, rather than a search that relies on keywords, said Eric Kim, a managing partner at Goodwater Capital. “The question is whether Pinterest will be one of the primary digital advertising players — not just taking away market share from print but expanding the pie through their visual search,” Kim said. Pinterest wasn’t as aggressive on its IPO pricing as it might have been, Kim said “I think they set it at a level that would give current investors upside in the future to get them excited about that,” he said. “It really comes down to that pricing call that Pinterest and their team decides where they want to start out at and track the right investors.”"
        },
        {
            "id": "9",
            "date": "1/04/2019",
            "tag": "entertainment",
            "img": "../resource/img9.jpg",
            "headline": "Vanity Fair announces its 2017 International Best-Dressed List. See who made the cut",
            "new": "false",
            "content": " The arrival of September means it's time to welcome a new fashion season — and naturally, the fashion icons who stand out from the crowd. On Wednesday, one day prior to the start of New York Fashion Week — and the announcement that Graydon Carter would step down as editor of Vanity Fair after 25 years — the storied magazine released its 2017 International Best-Dressed List. From sports legends to heads of state, the people who made it onto this list are undeniably some of the most stylish people on the planet. Some of the notable honorees include Rihanna, Harry Styles, Canadian Prime Minister Justin Trudeau, former President Barack Obama and former First Lady Michelle Obama, Jaden Smith and LeBron James. Did your favorite celebrity make the cut? Check out the full list below to see all the honorees. Women: Anh Duong, Charlotte Gainsbourg, Kirsten Green, Solange Knowles, Eugenie Niarchos, Rebecca de Ravenel, Rihanna, Queen Letizia of Spain, Lady Amelia Windsor, Dasha Zhukova. Men: Roberto Bolle, Roger Federer, Donald Glover, LeBron James, Henry Koehler, Daniel Romualdez, Jack Schlossberg, Charlie Siem, Harry Styles, Justin Trudeau"
        },
        {
            "id": "10",
            "date": "1/04/2019",
            "tag": "crime",
            "img": "../resource/img10.jpg",
            "headline": "Pacific Beach Crime & Safety Report",
            "new": "false",
            "content": " San Diego County Crime Stoppers, along with investigators from the San Diego Police Department 's Northern Division, are asking for the public's help in identifying the suspect(s) involved in at least eight incidents, reported between November 2018 and March 2019, when unknown objects were thrown at and/or shot at moving vehicles in the Pacific Beach area. The victims said they were driving in the vicinity of West Mission Bay Drive and Ingraham Street at the time of the incidents. All incidents occurred between the hours of 9:45 p.m. and 12:10 a.m. The vehicles involved sustained damages, estimated between $300 and $5,000, to the windshield and/or body. Two drivers sustained small lacerations from flying glass. Investigators are asking the public for any information that could lead to a suspect being identified. Investigators are asking motorists in the area to use caution at night and to notify police of any similar incidents. Anyone with information is asked to call SDPD's Northern Division at (858) 552-1700 or the Crime Stoppers anonymous tip line at (888) 580-8477. Crime Stoppers is offering up to a $1,000 reward to anyone with information that leads to an arrest in this case. Visit sdcrimestoppers.org for more information on how to send anonymous web and mobile app tips. "
        },
        {
            "id": "11",
            "date": "1/04/2019",
            "tag": "world",
            "img": "../resource/img11.jpg",
            "headline": "This cafe in India is fully run by acid attack survivors",
            "new": "false",
            "content": "More than 20 years ago, a man hurled acid into Madhu Kashyap’s face. It melted the skin on her cheeks and forehead and partially blinded her in one eye. For years she would not show her scarred face in public. People stared. She was once told that she looked OK from behind but that from the front, she was a witch. But on a recent morning, her lips glistened with ruby lipstick. She gathered her curly black hair to one side so the details of her face were more visible. And she smiled. Kashyap, 39, was at work at Sheroes’ Hangout, a cafe in this tourist city that is staffed by survivors of acid attacks. More than 300 attacks are reported each year in India, though human rights groups say the count probably exceeds 1,000. The perpetrators are often men who want to punish women for ending a relationship or spurning unwanted advances. Most attackers’ aim, experts say, is not to kill, but to maim and embarrass. The cafe in Agra offers a place for these women to earn money and find acceptance. At Sheroes, survivors don’t cover their faces. They comfortably discuss the scariest moments of their lives and chat with customers from around the world. They wear makeup to accentuate their features. They laugh."
        },
        {
            "id": "12",
            "date": "1/04/2019",
            "tag": "sports",
            "img": "../resource/img12.jpg",
            "headline": "Thunder, and a fan, heat up from long range to get back in series with Blazers",
            "new": "false",
            "content": " The Thunder’s communications head, Matt Tumbleson, turned around from his seat courtside with a big grin during the first timeout Friday night. A fan had just drilled a half-court shot for a $20,000 prize. He knew what that meant. “I think we’re undefeated when that happens,” Tumbleson said. And there might not be a team in the NBA playoffs that needed to see a shot from long range more than Oklahoma City. In the first two games of one of the most anticipated first-round playoff series, the Thunder were awful from behind the three-point line, making just 10 of 61 attempts (16.4 percent) in a pair of losses in Portland. But back home Friday night, the rims were a lot friendlier. A second fan won an additional $20,000 after he too made a half-court shot. The Thunder were just as hot, making 15 of 29 from three-point range in a critical 120-108 win over Portland in Game 3, avoiding a 3-0 series deficit thanks to some much-needed shotmaking. Russell Westbrook, Jerami Grant, Terrance Ferguson and Dennis Schroeder combined to make 13 of their 18 three-point shots. "
        },
        {
            "id": "13",
            "date": "1/04/2019",
            "tag": "travel",
            "img": "../resource/img13.jpg",
            "headline": "Florida travel calendar for September",
            "new": "true",
            "content": "Through Sept. 1: SeaWorld's Electric Ocean, Orlando. As the sun goes down, the park comes alive with the glow of Electric Ocean at SeaWorld, returning next year for another summer of fun. With exciting nighttime shows and electrifying music, guests are immersed in a sea of wonder that ends in Ignite, a spectacular finale with fireworks, lasers and fountains. Select nights with the price of admission.  https://seaworld.com/orlando/events/electric-ocean/.  Through Sept. 3: NKF Surf Festival, Cocoa Beach. The 33rd annual NKF Surf Festival features surfing, food, music and silent auction at the Radisson Resort to benefit the National Kidney Foundation of Florida. 321-784-5661. www.nkfsurf.com. Through Sept. 27: Bandshell Concert Series, Daytona Beach. The Bandshell Concert Series, in its 11th year, runs every Friday night. Concerts begin at 7 p.m. Tickets free for general admission; $10 for VIP (includes a chair) plus applicable fees, but children under 10 are free. At the amphitheater located in Oceanfront Park on the North end of the Boardwalk amusement area at 250 N. Atlantic Avenue. 386-255-0415. www.daytonabandshell.com"
        },
        {
            "id": "14",
            "date": "1/04/2019",
            "tag": "world",
            "img": "../resource/img14.jpg",
            "headline": "Comedian expected to crush incumbent in Ukraine’s presidential election",
            "new": "false",
            "content": " Faced with the strong possibility of being trounced by a comedian with no political experience, Ukrainian President Petro Poroshenko has started throwing Hail Marys. In the week leading up to this Sunday’s election, the 53-year-old president awkwardly performed a folk song on stage. He promised young voters he’d hire more of them in his next administration. And he apologized for past mistakes and met with civil society leaders to say he’d listen more if given another chance. In what appeared to be a direct response to accusations from his opponent — Volodymyr Zelensky — that he did nothing to battle the country’s endemic corruption, Poroshenko appointed 38 judges to the country’s new anti-corruption court in one fell swoop. If the latest polls are correct, the election will be a blow-out, with 72% of voters ready to cast their ballot for Zelensky, compared to 25% for Poroshenko. Zelensky, 41, has more than doubled his lead over the president since the first round of voting in March, when he beat out 38 other candidates, in a surprise upset. Because none of the candidates got more than 50% to win outright, the top two candidates now face a runoff. Zelensky rose to fame as an actor in his comedy troupe Kvartal 95. His latest hit is a television series, “Servant of the People,” in which he plays a history teacher who is elected president after a video of him ranting about corrupt politicians goes viral. He has run an anti-establishment campaign that has relied heavily on a savvy social media program that crowdsourced policy suggestions from voters. The approach has won over voters who say they are looking for a new, fresh face in a landscape of Ukraine’s usual political elite. "
        },
        {
            "id": "15",
            "date": "1/04/2019",
            "tag": "science",
            "img": "../resource/img15.jpg",
            "headline": "A wellness program at work may make you feel good, but it won’t improve your health",
            "new": "false",
            "content": "More than half of U.S. companies offer workplace wellness programs to their employees, but a new study suggests they do very little — if anything — to improve workers’ health. In an unusual clinical trial involving more than 8,000 employees of a warehouse retail chain, the presence of a wellness program did not help people lose weight, lower their blood pressure, reduce their cholesterol or cause them to spend less time and money on doctor visits. Nor did the program improve their job performance or reduce the number of sick days and personal days they took, according to results published this week in the Journal of the American Medical Assn. But that doesn’t mean companies should give up on wellness. Rather, they should be considered “a work in progress,” according to an editorial that accompanied the study. Workplace wellness programs became popular in the late 1980s as companies looked for new ways to lower employee healthcare costs and increase worker productivity, said Zirui Song, who studies healthcare policy at Harvard Medical School. The programs typically include exercise classes, tips on healthy eating and assistance to those who want to quit smoking. Companies sometimes offer financial incentives to encourage workers to participate. According to a 2018 survey by the Kaiser Family Foundation, 82% of large employers and 53% of smaller ones made some kind of wellness program available to their employees. MORE ON HEALTH: A gut bacterium as a fountain of youth? Well, let’s start with reversing insulin resistance » Although researchers have tried to gauge the effectiveness of these programs, they have rarely been tested in randomized controlled trials, which are considered the gold standard of medical research because they do the best job of isolating the effect — if any — of a particular treatment. Previous work “suggested there could be an enormous return on investment, but [they] didn’t have the scientific rigor you would want to rely on,” said Katherine Baicker, dean of the University of Chicago’s Harris School of Public Policy, who conducted the JAMA study with Song. Baicker and Song studied employees of BJ’s Wholesale Club, a retailer with 201 locations in the eastern United States. Twenty work sites were randomly selected to offer a voluntary wellness program to employees, and 20 others without such a program were randomly chosen to serve as controls. About 4,000 employees were in each group, and their overall profiles were very similar — in both cases, the average age was 38, about 54% were men, and roughly 57% were white. The workers with access to the wellness program could take up to eight classes lasting four to eight weeks on topics like nutrition, physical activity and reducing stress. In most cases, employees received a $25 gift card for completing a class. About 35% of workers completed at least one class, and 21% completed at least three. Employees in both groups were given health surveys to find out about their exercise habits, diets, smoking status and alcohol use. Nurses measured their blood pressure, body mass index and cholesterol levels, among other things. Insurance claims and employment records were used to track healthcare spending, sick days and workplace performance. A year and a half after the wellness program began, there were only two small signs that it might improve workers’ health."
        },
        {
            "id": "16",
            "date": "1/04/2019",
            "tag": "food",
            "img": "../resource/img16.jpg",
            "headline": "Baltimore's Best food and drinks",
            "new": "false",
            "content": "The small Fells Point restaurant, which grew from a hot dog truck that served steamed bun sandwiches, has evolved into one of the state’s most popular dining options. Known for its scrumptious twists on classic Asian dishes, Ekiben has been included on most top dining lists in Baltimore. It was honored for Maryland’s best sandwich in 2017 by Travel & Leisure and to Yelp’s annual top 100 eateries nationwide in 2019. But the restaurant is more than steamed buns and a strong Instagram presence. Its owners are all children of immigrants, and that feel comes through in its dishes. Papa Chu’s char siu Ribs are a nod to owner Steve Chu’s father. The red beans and rice — served with spicy lentils and tomato salad — and the spicy neighborhood bird sandwich both feature a blend that reflects co-owner Ephrem Abebe’s Ethiopian heritage. “They [customers] have been super supportive in what we do,” said Chu, who cut his teeth working for Top Chef winner Harold Dieterle. Chu credits Ben Lefenfeld, the owner of La Cuchara and Minnow, who encouraged him to open Ekiben. “Ben doesn’t mince words. When he tells you he likes your product, you better listen,” Chu said."
        },
        {
            "id": "17",
            "date": "1/04/2019",
            "tag": "entertainment",
            "img": "../resource/img17.jpg",
            "headline": "Can George Clooney persuade Hollywood to boycott hotels over Brunei’s antigay laws?",
            "new": "true",
            "content": " The Beverly Hills Hotel has long been a refuge where Hollywood could both hide and show its true self. Where actors could retreat from scandal, divorce, a botched plastic surgery. Where Humphrey Bogart and Frank Sinatra — and many, many others — got elegantly trashed at the Polo Lounge. Where waiters catered to Howard Hughes’ idiosyncrasies by having his roast beef sandwiches delivered to a tree nook. From Elizabeth Taylor celebrating six of her eight honeymoons there to Donald Trump holing up with Stormy Daniels in one of its famous curbside bungalows, the Pink Palace on Sunset Boulevard has remained at the heart of Hollywood since the beginning. No one much noticed when the sultan of Brunei bought the hotel in 1996. Even fewer would have connected that meal at the Polo Lounge with the tiny, oil-rich autocracy halfway around the world.  But a recent announcement by the sultanate might turn that sip of Chairman’s Sour — named after Sinatra — a bit too sour. Brunei says it will stone to death anyone charged with adultery or homosexuality, in accordance with sharia law, beginning Wednesday. This brought out the side of Hollywood that didn’t need to hide behind bougainvillea-draped walls, the one it loved to show the world: fighting for a cause. In a column for Deadline on Thursday, George Clooney called for a boycott of the hotel, Hotel Bel-Air and seven others in Europe owned by the sultan, who holds supreme power in Brunei. “They’re nice hotels,” Clooney wrote. “The people who work there are kind and helpful and have no part in the ownership of these properties. But let’s be clear, every single time we stay at or take meetings at or dine at any of these nine hotels we are putting money directly into the pockets of men who choose to stone and whip to death their own citizens for being gay or accused of adultery.” But the days when Hollywood celebrities could speak their political mind without blowback — even against patently deplorable human rights abuses — are long gone in America, perhaps even in liberal Hollywood itself."
        },
        {
            "id": "18",
            "date": "1/04/2019",
            "tag": "science",
            "img": "../resource/img18.jpg",
            "headline": "The end of California's drought could mean fewer cases of West Nile virus",
            "new": "false",
            "content": " Researchers say the end of California’s drought could offer a surprising benefit: reduced transmission of the mosquito-borne West Nile virus. Drought is the most important weather-related factor that affects the rate of West Nile infection, scientists say. Mosquito eggs need water to hatch, but dry conditions tend to spur greater transmission of the virus. “Ironically, when we have drought conditions, that does seem to amplify the West Nile virus transmission cycle,” said Vicki Kramer, chief of the Vector-Borne Disease Section at the California Department of Public Health. West Nile is transmitted between mosquitoes and birds. People can become infected if bitten by an infected mosquito. (The illness is rarely transmitted from one person to another.) It’s not clear why drought makes it easier for the virus to spread. One possibility is that drought forces mosquitoes and birds into closer proximity around the few remaining sources of water. That would increase the chance of infection. Another possible explanation is that dry conditions tax birds’ immune systems, leaving them more vulnerable to infection."
        },
        {
            "id": "19",
            "date": "1/04/2019",
            "tag": "sports",
            "img": "../resource/img19.jpg",
            "headline": "Enrique Hernandez smashes a homer against Josh Hader to lift Dodgers over Brewers",
            "new": "true",
            "content": " The Dodgers were denting Josh Hader’s usually unblemished armor in the eighth inning of their 5-3 win Friday night, steadily pecking at baseball’s best left-handed reliever, but time was running out. Hader had faced four batters in the inning before Enrique Hernandez stepped into the batter’s box to try to solve the shaggy-haired slinger. Two walked, offering hints of Hader’s mortality. Two struck out, offering reminders of Hader’s dominance. Then Hader pounced on Hernandez, firing two 94-mph fastballs by him to go up 0-2 and clench Hernandez in a vise-grip. Before the clash, Hader had gone up 0-2 on a hitter 82 times in his career. The Milwaukee Brewers’ relief ace had never issued a walk. He had allowed four hits for an .049 batting average against. The only extra-base hit was a double. Hernandez’s long odds of success grew longer in a blink. But Friday’s sequence took a detour. Hader didn’t finish Hernandez off. He didn’t wiggle out of the rare trouble. Instead, to the palpable shock of the thousands at Miller Park, Hernandez turned on a 96-mph fastball up over the plate and whacked it over the left-field wall for the go-ahead three-run home run. “In that situation, I was just trying to put the ball in play, stay as short as possible,” said Hernandez, who entered the game as part of a double-switch in the sixth inning. “And the ball happened to catch the barrel.” The homer — Hernandez’s fifth this season — was the fifth Hader has surrendered with two strikes since breaking into the majors and establishing himself as a force in 2017. It was Hernandez’s first career home run on an 0-2 count, his first hit against Hader in six career encounters, and it was the difference in the Dodgers (14-8) extending their winning streak to six games. "
        },
        {
            "id": "20",
            "date": "1/04/2019",
            "tag": "politics",
            "img": "../resource/img20.jpg",
            "headline": "State Republicans challenge Democrats with ‘born-alive’ bills",
            "new": "true",
            "content": "Republican legislators across the country are rallying behind President Donald Trump's efforts to link Democrats with infanticide, daring Democratic governors to veto born alive bills animating the party's base before the 2020 elections. Bills approved by GOP-run legislatures in Montana and North Carolina this week would penalize health care providers for failing to care for an infant who survives an abortion attempt. The measures, which are also winding through legislatures in Texas and elsewhere, are being pushed by anti-abortion groups that quickly seized on bills in New York and Virginia aimed at loosening restrictions on third-trimester abortions. Pro-life activists in the legislature are really making things uncomfortable for the governors,said Mallory Quigley, a spokesperson with Susan B. Anthony List, an anti-abortion group allied with the Trump administration. Now they have a tricky situation politically with these pro-life bills headed to their desk. North Carolina Gov. Roy Cooper, who faces reelection next year in a state Trump won by 3.6 percentage points, on Thursday vetoed the bill state lawmakers passed two days earlier. A spokesperson for Montana Gov. Steve Bullock, who is mulling a presidential run as a bridge-building moderate, indicated he will likely do the same."
        },
        {
            "id": "21",
            "date": "2/04/2019",
            "tag": "sports",
            "img": "../resource/img21.jpg",
            "headline": "Lakers’ coaching search enters Round 2, with Jeanie Buss expected to get involved",
            "new": "true",
            "content": " The Lakers’ coaching search will last into at least next week, and Lakers co-owner Jeanie Buss will be getting involved. Empowered by Buss to run the coaching search, Lakers general manager Rob Pelinka met with Tyronn Lue and Monty Williams this week, with plans to interview both again next week. While those second interviews have not been officially scheduled yet, they are expected to include Buss, according to people familiar with the Lakers’ plans who weren’t authorized to speak publicly. Pelinka also will meet with Juwan Howard, his former teammate at Michigan, who is an assistant coach with the Miami Heat. That meeting is expected to take place Tuesday, according to people familiar with the Lakers’ plans. All three candidates are former NBA players. Only Lue and Williams have head coaching experience. The first week of the search followed a chaotic week for the franchise. On April 9, Magic Johnson resigned as the Lakers’ president of basketball operations, telling reporters before telling Buss or any other member of the organization. Buss has no plans to hire someone to replace Johnson, who is still expected to be part of the Lakers’ free-agent recruiting this summer in some capacity. One reason Johnson gave for his departure was that he didn’t want to ask Buss to fire Luke Walton. But three days later, Walton and the Lakers reached an agreement to part ways. Walton is now the head coach of the Sacramento Kings. "
        },
        {
            "id": "22",
            "date": "1/04/2019",
            "tag": "entertainment",
            "img": "../resource/img22.jpg",
            "headline": "Anne Arundel court clerk issues new guidance on dress code policy",
            "new": "true",
            "content": " Newly issued guidance on dress code at Anne Arundel Circuit Court outlines a policy that regulates men’s and women’s clothing in an effort the court’s clerk said keeps the office “professional and consistent.” The policy outlined in a memo sent to employees of the Clerk of the Circuit Court’s Office by newly elected clerk Scott Poyer on Jan. 29 outlines how Poyer interprets what appropriate dress for the office is as dictated by state statute. Quoting the “personal appearance” section of conduct policy by the Administrative Office of the Courts, which oversees Maryland’s Judiciary, Poyer goes on to define what he said is in line with restriction on men’s and women’s appearance at Circuit Court. The memorandum is heavy on restricted women’s clothing, which defines everything from how women’s underarms should not be exposed to how “capris cut above the mid-calf” are inappropriate. “Clothing should be professional, clean, and well-fitting — not too tight, too short or too long,” the memorandum reads. The memo goes into significant details as to what “appropriate” means as well, describing “cap sleeve tops that expose your under arm” and “capris cut above the mid-calf” as “prohibited clothing.” "
        },
        {
            "id": "23",
            "date": "3/04/2019",
            "tag": "entertainment",
            "img": "../resource/img23.jpg",
            "headline": "Silver Lake hacienda tied to Leonardo DiCaprio sells for $1.55 million",
            "new": "true",
            "content": " Leonardo DiCaprio is still wheeling and dealing on the L.A. real estate scene. The Academy Award-winning actor has sold a Silver Lake property he owned in a trust for $1.555 million, records show. Earlier this year, he bought a Los Feliz home from musician Moby for a family member. The Silver Lake property, built in 1931, was also occupied by one of DiCaprio’s relatives. Spanish tile rings the custom front door, and there’s a gated courtyard entry with a koi pond. Both entrances set the tone for a floor plan filled with original details. Coved ceilings with wood beams top the living room, which features a fireplace sandwiched between a pair of French doors. The 3,560-square-foot interior also holds parquet floors, arched doorways and a kitchen rife with white-and-blue tile. "
        },
        {
            "id": "24",
            "date": "2/04/2019",
            "tag": "food",
            "img": "../resource/img24.jpg",
            "headline": "Best bakery",
            "new": "true",
            "content": "With bright colors, darling shapes and sleek finishes, the pastries at the Fells Point bakery are almost too pretty to eat. Almost. After a bite, you’ll be entranced by an explosion of flavor. Take the Robin’s egg blue dome-shaped Sofia petit gateau, which is filled with layers of almond cake, crunchy almond praline and an Earl Grey-and-bergamot mousse. Or try the toasty éclair, which features a torched marshmallow topping. Owners Manuel Sanchez and Dane Thibodeau want to teach you some of their tricks with their macaron-making classes. The sessions feature a wine-and-cheese hour and allow you to take home all the macarons you make in class. And if your creations fall flat, they’ll send you home with macarons they have made themselves. Sanchez attributes the shop’s success to having “passion and dedication in everything we do.” He added: “We are bringing a more modern approach to our pastries, combining unusual flavors, modern glazing techniques and textures.” That means using ingredients and spices like wasabi, Mexican mole, jasmine, bergamot and eucalyptus. Currently the bakery offers a saffron cake. “When we think about creating a dessert, we think in terms of an experience or a symphony of flavors and textures in your mouth,” Sanchez said."
        },
        {
            "id": "25",
            "date": "1/04/2018",
            "tag": "local-news",
            "img": "../resource/img25.png",
            "headline": "A quake every 3 minutes: California shaken by 10 times more temblors than previously known",
            "new": "true",
            "content": " California has experienced 10 times more earthquakes than previously known, according to groundbreaking new research that has helped scientists better understand the region’s seismology. Scientists documented 1.8 million earthquakes in Southern California over the last decade — with 90% of them newly discovered and so small they had long been undetectable to modern computing systems. Previously, only 180,000 earthquakes were on record for the last 10 years.  Researchers now have a better ability to identify undiscovered faults, detect patterns of moving earthquake swarms, and identify faint clusters of foreshocks that occur before a larger earthquake. “We see incredible details,” Caltech seismologist Zachary Ross said of the newly discovered earthquakes he outlined in a study released Thursday in the journal Science, of which he was the lead author. “We start to see new faults emerging.” “It is a pretty exciting moment in seismology,” said Kate Scharer, a U.S. Geological Survey research geologist who was not involved in the study. “It’s long been desired to understand ... what’s happening in the time leading up to large earthquakes. A big question for us is how the state of stress might evolve, anywhere from days to months, leading up to large earthquakes.” Scientists have long understood a key mathematical relationship in earthquake magnitudes: For each whole-number drop in magnitude, there are 10 times as many earthquakes. For instance, for every magnitude 7 earthquake, there are 10 magnitude 6 temblors, 100 magnitude 5 shakers, 1,000 magnitude 4 events, and so forth. But until now, scientists hadn’t been able to collect a comprehensive inventory of earthquakes of less than magnitude 1.7 (with some recorded as small as magnitude negative 2) over a wide region and a period of years. The discovery of these micro-earthquakes in Southern California is the first time magnitude 0 and magnitude 1 earthquakes have been documented over such a vast region during a long period — between 2008 and 2017. This means a detectable earthquake, on average, occurs every 3 minutes in Southern California — much more frequent than the old estimate of one temblor every half-hour. An eye-popping result from the discovery was showing just how widespread an effect the last big earthquake had after it shook Southern California — the Easter Sunday magnitude 7.2 earthquake of 2010. That event had an epicenter across the border, close to the Mexican city of Mexicali. Previously, it was clear only that the Easter Sunday earthquake triggered an increased rate of temblors — within a week of the main quake — up to about 100 miles away from its epicenter, reaching rural eastern San Diego County and the Salton Sea area. Now, there’s evidence it actually increased earthquake activity as much as 170 miles away — reaching Riverside, San Bernardino and Palm Springs. "
        },
        {
            "id": "26",
            "date": "1/04/2019",
            "tag": "crime",
            "img": "../resource/img26.jpg",
            "headline": "Violent crime up in southwestern Baltimore County, while crime is down overall",
            "new": "true",
            "content": " The southwestern area of Baltimore County saw a 9.4 percent increase in violent crimes in 2018 from the prior year, while overall crime was down in that same time frame, according to crime data published in early February by the Baltimore County Police Department. The southwestern area stretches from Baltimore Highlands to Baltimore National Pike. Countywide, meanwhile, violent crime was down 4.5 percent. In 2018, the Wilkens Precinct experienced six homicides, 45 reported rapes, 196 robberies and 379 aggravated assaults — or 54 more violent incidents than in 2017, when there were five reported homicides, 35 rapes, 196 robberies, 335 aggravated assaults and one reported human trafficking incident. County police said in a statement that one reason for an increase in reported rape incidents was a legislative change in Maryland that redefined rape, as of Oct. 1, 2017. The law changed the definition so that a victim does not have to physically resist for an attack to be considered a rape. Cpl. Shawn Vinson, a police department spokesman, said the department was not aware of any particular trend or reason behind the increase in aggravated assaults last year. He said people should be aware of their surroundings, call 911 if they see anything suspicious and not display any valuables on their person or in parked vehicles. Wilkens Capt. Eliot Latchaw said he will be implementing some strategies to address area crime. "
        },
        {
            "id": "27",
            "date": "1/04/2019",
            "tag": "nation",
            "img": "../resource/img27.jpg",
            "headline": "Ullamcorper dignissim cras tincidunt lobortis",
            "new": "true",
            "content": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
        },
        {
            "id": "28",
            "date": "2/04/2019",
            "tag": "world",
            "img": "../resource/img28.jpg",
            "headline": "Peru’s ex-President Alan Garcia kills himself as police try to arrest him",
            "new": "true",
            "content": " Former Peruvian President Alan Garcia died after shooting himself as police waited Wednesday to arrest him on corruption allegations involving a massive Latin American bribery scandal. Garcia, 69, who served two terms as Peru’s president, from 1985 to 1990 and from 2006 to 2011, shot himself in his bedroom at his home in Lima, the capital, as police waited outside his door to take him to jail. He was rushed to a hospital, where he died despite emergency surgery. Peruvian President Martin Vizcarra wrote on Twitter: Dismayed over the death of ex-President Alan Garcia. I send my condolences to his family and loved ones. Prosecutors had ordered Garcia’s arrest over allegations that he took payoffs from a construction company. Scandal involving the same Brazilian-based firm has led to the arrest of, or extradition requests for, all of Peru’s living former presidents save one. At the center of the controversy is the construction giant Odebrecht, whose officials have admitted paying hundreds of millions of dollars in bribes to secure lucrative public works contracts. Investigations surrounding the global firm set off investigations that have ensnared officials across South America. The order to arrest Garcia came from Jose Domingo Perez, a special prosecutor in charge of Odebrecht investigations. He said money from the construction firm illegally helped finance Garcia's 2006 election campaign. Perez was also investigating a bank account in Andorra believed to be controlled by Garcia that held $1.3 million in funds from Odebrecht. Prosecutors have said Garcia’s government may have accepted up to $14 million in illegal payments during his latter term in office. Interior Minister Carlos Moran told reporters that Garcia met officers who appeared at his doorstep early Wednesday morning to take him into custody. But he refused to go, and turned and walked upstairs to his bedroom. "
        },
        {
            "id": "29",
            "date": "1/04/2019",
            "tag": "local-news",
            "img": "../resource/img29.jpg",
            "headline": "After Nipsey Hussle’s shooting, students closest to him vow to lift up their community",
            "new": "true",
            "content": " Kaya Buckley is a fan of Nipsey Hussle’s music. Her friends at Crenshaw High School shop at the clothing store where he was shot and killed Sunday, less than a mile from campus. But the 17-year-old knew Hussle and identified with him most as a fellow community activist. She first met him at a Hyde Park community meeting about a new Metro line. He spoke about development he wanted to see in the area, and his own investments in businesses, technology and other local enterprises. Afterward, Kaya timidly asked Hussle for his autograph, and told him she was shy. Hussle “looked me in my eye and he was like, ‘You know, you can’t be shy all the time, and you’ve got to speak up’ … and he told me that a closed mouth doesn’t get fed,” Kaya said. Hussle was embedded in the community and spent time with young people like Kaya, donating resources and speaking alongside high school students on panels about growing up in the area and the influence of gang culture. He rapped about eating cookies at his grandmother’s house near 59th Street Elementary, and refurbished the school’s basketball court last year. Because of that involvement, students at some neighborhood schools are experiencing his death in a more personal way than just as music fans. "
        },
        {
            "id": "30",
            "date": "3/04/2019",
            "tag": "nation",
            "img": "../resource/img30.jpg",
            "headline": "Eu lobortis elemelkjntum nibh tellus",
            "new": "true",
            "content": "Sagittis orci a scelerisque purus semper. Mauris cursus mattis molestie a. Faucibus interdum posuere lorem ipsum. Sed risus pretium quam vulputate dignissim suspendisse. Tortor posuere ac ut consequat semper. Elit scelerisque mauris pellentesque pulvinar pellentesque habitant morbi tristique. Commodo viverra maecenas accumsan lacus vel facilisis. Integer vitae justo eget magna fermentum iaculis eu non. Viverra orci sagittis eu volutpat odio. Facilisi cras fermentum odio eu feugiat pretium nibh. In iaculis nunc sed augue lacus viverra vitae. Est pellentesque elit ullamcorper dignissim cras tincidunt lobortis feugiat vivamus. Nunc congue nisi vitae suscipit tellus mauris a diam maecenas. Mauris nunc congue nisi vitae suscipit. Id volutpat lacus laoreet non curabitur gravida arcu ac. Nec dui nunc mattis enim ut tellus. Pulvinar elementum integer enim neque volutpat. Vitae et leo duis ut diam quam. Felis eget velit aliquet sagittis id. Posuere lorem ipsum dolor sit amet."
        },
        {
            "id": "31",
            "date": "2/04/2019",
            "tag": "world",
            "img": "../resource/img31.jpg",
            "headline": "Germany to close all 84 of its coal-fired power plants, will rely primarily on renewable energy",
            "new": "true",
            "content": " Germany, one of the world’s biggest consumers of coal, will shut down all 84 of its coal-fired power plants over the next 19 years to meet its international commitments in the fight against climate change, a government commission said Saturday. The announcement marked a significant shift for Europe’s largest country — a nation that had long been a leader on cutting CO2 emissions before turning into a laggard in recent years and badly missing its reduction targets. Coal plants account for 40% of Germany’s electricity, itself a reduction from recent years when coal dominated power production. “This is an historic accomplishment,” said Ronald Pofalla, chairman of the 28-member government commission, at a news conference in Berlin following a marathon 21-hour negotiating session that concluded at 6 a.m. Saturday. The breakthrough ended seven months of wrangling. “It was anything but a sure thing. But we did it,” Pofalla said. “There won’t be any more coal-burning plants in Germany by 2038.” The plan includes some $45 billion in spending to mitigate the pain in coal regions. The commission’s recommendations are expected to be adopted by Chancellor Angela Merkel’s government. “It’s a big moment for climate policy in Germany that could make the country a leader once again in fighting climate change,” said Claudia Kemfert, professor for energy economics at the DIW Berlin, the German Institute for Economic Research. “It’s also an important signal for the world that Germany is again getting serious about climate change: a very big industrial nation that depends so much on coal is switching it off.” "
        },
        {
            "id": "32",
            "date": "1/04/2018",
            "tag": "local-news",
            "img": "../resource/img32.jpg",
            "headline": "Tempus quhgjam pellentesque lj nam",
            "new": "true",
            "content": "Sed ullamcorper morbi tincidunt ornare massa eget egestas. Tellus elementum sagittis vitae et leo duis ut diam. Odio ut sem nulla pharetra diam sit. Massa vitae tortor condimentum lacinia quis. Dictumst vestibulum rhoncus est pellentesque elit. In nulla posuere sollicitudin aliquam ultrices sagittis. Tristique risus nec feugiat in fermentum. Leo integer malesuada nunc vel risus. Ipsum dolor sit amet consectetur adipiscing. Enim ut sem viverra aliquet eget sit amet. At tellus at urna condimentum mattis pellentesque id nibh. Velit sed ullamcorper morbi tincidunt ornare massa. Cursus vitae congue mauris rhoncus aenean. Lacus suspendisse faucibus interdum posuere lorem ipsum. A scelerisque purus semper eget duis at tellus. Urna molestie at elementum eu facilisis sed odio morbi. Massa ultricies mi quis hendrerit. Facilisis magna etiam tempor orci eu lobortis elementum nibh tellus."
        },
        {
            "id": "33",
            "date": "1/04/2019",
            "tag": "politics",
            "img": "../resource/img33.jpg",
            "headline": "Former Obama White House counsel Greg Craig set for Aug. 12 trial",
            "new": "true",
            "content": "Former Obama White House counsel Greg Craig will go on trial Aug. 12 on charges that he lied to and concealed information from the Justice Department about his work for Ukraine, according to a judge’s scheduling order issued Friday. U.S. District Court Judge Amy Berman Jackson set the trial date in Washington, D.C., along with a series of other key dates in the case, which spun out of special counsel Robert Mueller’s probe into Russian interference in the 2016 presidential election. Federal prosecutors from the U.S. attorney’s office in Washington are now handling the Craig case, which centers around allegations that he should have registered as a foreign lobbyist for legal work he did starting in 2012 to defend Ukrainian President Viktor Yanukovych’s jailing of a political opponent. Craig, 74, has pleaded not guilty to the charges. His lawyers earlier this week signaled that their defense will center around the argument that there’s no affirmative duty under the law to convey “all relevant facts” to the government. Craig’s case deals with work he did at the Skadden, Arps, Slate, Meagher & Flom law firm after his one-year government stint at the start of the Obama administration. Other key dates in Jackson’s order include a May 10 deadline for Craig’s lawyers to file any motions to dismiss the case and an Aug. 5 pretrial conference."
        },
        {
            "id": "34",
            "date": "1/04/2019",
            "tag": "politics",
            "img": "../resource/img34.jpg",
            "headline": "Warren calls on Congress to launch impeachment proceedings against Trump",
            "new": "true",
            "content": "Sen. Elizabeth Warren on Friday called on Congress to impeach President Donald Trump in the wake of the publication of special counsel Robert Mueller’s report, breaking with Democratic leaders deferring the politically risky move despite new evidence that Trump attempted to derail the Russia probe. “To ignore a President’s repeated efforts to obstruct an investigation into his own disloyal behavior would inflict great and lasting damage on this country, and it would suggest that both the current and future Presidents would be free to abuse their power in similar ways,” Warren said on Twitter. “The severity of this misconduct demands that elected officials in both parties set aside political considerations and do their constitutional duty,” the Massachusetts Democrat added. “That means the House should initiate impeachment proceedings against the President of the United States.” Mueller’s 448-page report described at least 10 instances in which Trump attempted to interfere with the probe, implying that the president may have escaped an incriminating finding because top aides refused to carry out his most dramatic orders."
        },
        {
            "id": "35",
            "date": "2/04/2019",
            "tag": "politics",
            "img": "../resource/img35.jpg",
            "headline": "Trump campaign punishes Don McGahn's law firm",
            "new": "true",
            "content": "The Trump campaign has hired its own in-house attorney for its 2020 reelection bid — shifting future business away from Jones Day, the law firm, that has represented Trump since his first run for president. Campaign officials and advisers cast the decision to hire Nathan Groth — a former lawyer for the Republican National Committee and Wisconsin Gov. Scott Walker — as a money-saving move, supported by the businessman-turned-president who loves to cut costs. But close Trump advisers say the decision also stems from disappointment with the White House’s former top attorney and current Jones Day partner, Don McGahn, whose behavior has irked the president and some of his family members. Taking business away from Jones Day is payback, these advisers say, for McGahn’s soured relationship with the Trump family and a handful articles in high-profile newspapers that the family blames, unfairly or not, on the former White House counsel."
        },
        {
            "id": "36",
            "date": "1/04/2019",
            "tag": "politics",
            "img": "../resource/img36.jpg",
            "headline": "Warren approaches breakout with black voters",
            "new": "true",
            "content": "BEAUFORT, S.C. — When Elizabeth Warren got a question on housing discrimination at a campaign event this week, she went into full wonk mode — and the diverse crowd packed into a middle-school auditorium ate it up. The Massachusetts senator launched into a brief history lesson on African-American homebuyers being rejected outside designated areas, black families getting hit hardest by subprime mortgages and foreclosures during the 2008 crash, and black homeownership still lagging far behind whites. “That’s a problem, and it’s a race problem,” Warren thundered, emphasizing “race” as the crowd erupted into applause. “And we need to attack it head on.” Warren is stuck in single digits in national polls and is being overshadowed by white male rivals like Bernie Sanders and Pete Buttigieg. But her consistent attention to racial disparities — and her truckful of policy proposals to fix them across every economic issue — is drawing praise from a critical voting bloc that could eventually pay dividends: African-Americans, and especially African-American women. The plans are penetrating the community of black operatives and activists working to mobilize black voters in 2020. Her housing affordability proposal is hailed as one that would do the most to close the racial wealth gap. She was one of the first candidates to endorse a House bill establishing a commission to study reparations for the descendants of slaves. And when she held a climate change forum in Charleston recently four out of the six panelists were local African-American leaders. "
        },
        {
            "id": "37",
            "date": "3/04/2019",
            "tag": "politics",
            "img": "../resource/img37.png",
            "headline": "The Democratic base is angry as hell’: Cory Booker’s message of love falls flat",
            "new": "true",
            "content": " Polling in the single digits and lagging top-tier competitors in fundraising, Booker this week sought to reboot his campaign, launching a “Justice For All” two-week, national tour heavy on economic policy proposals and social justice messaging. In Iowa, he rolled out an expansive proposal for a new income tax credit and talked about the need for rural infrastructure investment. In Georgia, he unveiled a voting rights plan, vowing to make Election Day a national holiday and talked about restoring voting rights to ex-felons. The recent steps aim to invigorate a presidential bid that has underwhelmed some Democrats who are questioning whether Booker’s message is one that resonates in the Trump era."
        },
        {
            "id": "38",
            "date": "1/04/2019",
            "tag": "crime",
            "img": "../resource/img38.jpg",
            "headline": "Dropping handgun board won't reduce crime",
            "new": "false",
            "content": " Reading the recent editorial, “In Annapolis, small but important steps on gun reform” (March 26), I felt compelled to respond. I see you denigrating the Maryland Handgun Permit Review Board, yet concealed carry permit holders are virtually non-existent in crime statistics. Our neighboring states and the District of Columbia have multiples of our number of permits per thousand residents, yet the Maryland State Police get to cherry pick who does and does not get a permit with restrictions. The board called out the process. If the Maryland General Assembly truly wants to slow gun crime, they need to pass mandatory minimum sentences for gun crimes instead of more laws on law-abiding citizens. "
        },
        {
            "id": "39",
            "date": "1/04/2019",
            "tag": "crime",
            "img": "../resource/img39.jpg",
            "headline": "Kabul attack: Seven killed at Afghan ministry of information",
            "new": "true",
            "content": "Seven people were killed in an attack on the Afghan ministry of information in Kabul, officials said. An explosion was heard at 11:40 local time (07:10 GMT) and sporadic gunfire continued for over six hours before officials declared the incident over. A ministry source said one of the attackers got inside the building. The attack comes a day after talks between Afghan officials and the Taliban were suspended, but the Taliban said they were not behind the assault. Among the dead were four civilians and three police officers, while another eight civilians were wounded. Although Kabul still sees fighting, this attack follows months of relative calm."
        },
        {
            "id": "40",
            "date": "1/04/2019",
            "tag": "crime",
            "img": "../resource/img40.jpg",
            "headline": "Animal abuse could become federal crime",
            "new": "true",
            "content": " There was a slight uptick in 4S Ranch property crimes last year, unlike in 2017 when they jumped by 45 incidents due to a significant increase in thefts and commercial burglaries, according to statistics posted on ARJIS, the Automated Regional Justice Information System. The unincorporated community is served by the San Diego County Sheriff’s Department. There were 170 property crimes reported from January to December of last year, just three more than the 167 reported in 2017. In comparison, there were 122 property crimes reported during 2016. Once again, the vast majority of these crimes were thefts, with 124 reported during 2018. They were almost evenly split between those valued at $400 or higher (66 incidents) and below $400 (58 incidents). In 2017, there were 119 total, with 50 valued at $400 or higher and 60 below $400. In 2016 there were 93 thefts reported. There were four fewer residential burglaries in last year (17 reported) compared to 2017 (21 reported). Commercial burglaries remained the same, with 19 reported in both 2017 and 2018. In 2016, eight commercial burglaries and 16 residential burglaries were reported. Auto thefts slightly climbed, with 10 reported last year and eight the year before. In 2016, five were reported. There was a small decline in reported violent crimes in 2018, reverting back to the 2016 total of 11 reported. In 2017 there were 13 violent crimes. Six robberies were reported in 2018, twice as many as in both 2017 and 2016, which each had three reported. There was half as many aggravated assaults — four in 2018 instead of eight as in 2017. (In 2016 there had been seven.) There was one reported rape in 2018, compared to two reported in 2017 and one in 2016. As in the two previous years, there were no murders in 2018. "
        }
    ],
    "week-weather": [
        {
            "day": "Monday",
            "temperature": "15°C",
            "description": "Sunny",
            "precipitation": "2%",
            "humidity": "29%",
            "wind": "24 km/h"
        },
        {
            "day": "Tuesday",
            "temperature": "10°C",
            "description": "Showers",
            "precipitation": "3%",
            "humidity": "50%",
            "wind": "22 km/h"
        },
        {
            "day": "Wednesday",
            "temperature": "11°C",
            "description": "Cloudy",
            "precipitation": "2%",
            "humidity": "39%",
            "wind": "28 km/h"
        },
        {
            "day": "Thursday",
            "temperature": "17°C",
            "description": "Rain",
            "precipitation": "4%",
            "humidity": "78%",
            "wind": "29 km/h"
        },
        {
            "day": "Friday",
            "temperature": "20°C",
            "description": "Mostly Sunny",
            "precipitation": "2%",
            "humidity": "65%",
            "wind": "20 km/h"
        },
        {
            "day": "Saturday",
            "temperature": "14°C",
            "description": "Partly Cloudy",
            "precipitation": "3%",
            "humidity": "22%",
            "wind": "18 km/h"
        },
        {
            "day": "Sunday",
            "temperature": "6°C",
            "description": "Scattered Thunderstorms",
            "precipitation": "2%",
            "humidity": "87%",
            "wind": "30 km/h"
        }
    ]
}